EDT/УТ/src/Documents/УвольнениеСРаботыИзОрганизация/УвольнениеСРаботыИзОрганизация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УвольнениеСРаботыИзОрганизация</name>
  <registerRecords>InformationRegister.РаботникиОрганизации</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУвольнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/РаботникиОрганизации/РаботникиОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизации</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеРаботникаОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетВПроектнойДеятельности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновноеНачисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикУчетаРабочегоВремени</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ПланируемыеПолигоныЭкипажей/ПланируемыеПолигоныЭкипажей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланируемыеПолигоныЭкипажей</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПолигонУчитывается</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.УвольнениеСРаботыИзОрганизация</types>
    </type>
  </attributes>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СхемаПолигональнойМаршрутизации</name>
    <type>
      <types>CatalogRef.СхемыПолигональнойМаршрутизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаМаршрутизации</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Полигон</name>
    <type>
      <types>CatalogRef.ПолигоныМаршрутизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/СостояниеРаботникаОрганизации/СостояниеРаботникаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеРаботникаОрганизации</name>
  <enumValues>
    <name>ПринятНаРаботуВОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/УвольнениеСРаботыИзОрганизация/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РаботникиОрганизации
	Движения.РаботникиОрганизации.Записывать = Истина;
	Движения.РаботникиОрганизации.Очистить();
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.РаботникиОрганизации.Добавить();
		Движение.Период = ТекСтрокаСотрудники.ДатаУвольнения;
		Движение.Организация = Организация;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Подразделение = ТекСтрокаСотрудники.Подразделение;
		Движение.Должность = ТекСтрокаСотрудники.Должность;
		Движение.Состояние = Перечисления.СостояниеРаботникаОрганизации.Уволен;
		Движение.ГрафикУчетаРабочегоВремени = ТекСтрокаСотрудники.ГрафикРаботы;
		//CeHbKA 13.05.2019 #3103	
		Движение.ФизЛицо = ТекСтрокаСотрудники.ФизЛицо;
		Движение.Терминал = Терминал;
		//CeHbKA 13.05.2019 #3103	
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	//Переварюха В.В. 13.02.2020 Задача № 3783
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УвольнениеСРаботыИзОрганизацияСотрудники.Ссылка КАК Ссылка,
		|	УвольнениеСРаботыИзОрганизацияСотрудники.Сотрудник КАК Сотрудник,
		|	УвольнениеСРаботыИзОрганизацияСотрудники.ДатаУвольнения КАК ДатаУвольнения
		|ПОМЕСТИТЬ новаВодители
		|ИЗ
		|	Документ.УвольнениеСРаботыИзОрганизация.Сотрудники КАК УвольнениеСРаботыИзОрганизацияСотрудники
		|ГДЕ
		|	УвольнениеСРаботыИзОрганизацияСотрудники.Ссылка = &Ссылка
		|	И ТИПЗНАЧЕНИЯ(УвольнениеСРаботыИзОрганизацияСотрудники.Сотрудник) = ТИП(Справочник.новаВодители)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	новаВодители.Ссылка КАК Ссылка,
		|	новаВодители.Сотрудник КАК Сотрудник,
		|	ПланируемыеПолигоныЭкипажейСрезПоследних.Водитель КАК Водитель,
		|	ПланируемыеПолигоныЭкипажейСрезПоследних.СхемаПолигональнойМаршрутизации КАК СхемаПолигональнойМаршрутизации,
		|	ПланируемыеПолигоныЭкипажейСрезПоследних.СменаМаршрутизации КАК СменаМаршрутизации,
		|	ПланируемыеПолигоныЭкипажейСрезПоследних.Полигон КАК Полигон,
		|	новаВодители.ДатаУвольнения КАК ДатаУвольнения
		|ИЗ
		|	новаВодители КАК новаВодители
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланируемыеПолигоныЭкипажей.СрезПоследних(
		|				&Дата,
		|				Водитель В
		|					(ВЫБРАТЬ
		|						новаВодители.Сотрудник КАК Сотрудник
		|					ИЗ
		|						новаВодители КАК новаВодители)) КАК ПланируемыеПолигоныЭкипажейСрезПоследних
		|		ПО новаВодители.Сотрудник = ПланируемыеПолигоныЭкипажейСрезПоследних.Водитель
		|ГДЕ
		|	ПланируемыеПолигоныЭкипажейСрезПоследних.ПолигонУчитывается";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПланируемыеПолигоныЭкипажей.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Период = ВыборкаДетальныеЗаписи.ДатаУвольнения;
		МенеджерЗаписи.Водитель = ВыборкаДетальныеЗаписи.Водитель;
		МенеджерЗаписи.СхемаПолигональнойМаршрутизации = ВыборкаДетальныеЗаписи.СхемаПолигональнойМаршрутизации;
		МенеджерЗаписи.СменаМаршрутизации = ВыборкаДетальныеЗаписи.СменаМаршрутизации;
		МенеджерЗаписи.Полигон = ВыборкаДетальныеЗаписи.Полигон;
		МенеджерЗаписи.ПолигонУчитывается = Ложь;
		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.ДокументРегистратор = Ссылка;

		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	//Переварюха В.В. 13.02.2020 Задача № 3783
КонецПроцедуры
